import React from 'react';
import { Link } from 'react-router-dom';

export default () => (
  <div>
    <h1 id="免責事項">免責事項</h1>
    <p><Link to="/">https://pages.tech-frodo.xyz/</Link>(以下、当サイト)からリンクやバナーなどによって他のサイトに移動された場合、移動先サイトで提供される情報、サービス等について一切の責任を負いません。</p>
    <p>当サイトのコンテンツ・情報につきまして、可能な限り正確な情報を掲載するよう努めておりますが、誤情報が入り込んだり、情報が古くなっていることもございます。</p>
    <p>当サイトに掲載された内容によって生じた損害等の一切の責任を負いかねますのでご了承ください。</p>
    <h2 id="著作権帰属">著作権帰属</h2>
    <p>
      特段の表示がない限り、当サイト内の文章、画像、動画その他コンテンツは全てFrodo(以下、管理人)に帰属します。
      管理人の許諾なきサイトコンテンツの転載、引用の一切は固く禁じます。
    </p>
    <h3 id="引用の許可">引用の許可</h3>
    <p>当サイトのコンテンツの引用および転載は次の場合にのみ許諾します。</p>
    <ol>
      <li>商用ではないコンテンツへの部分的な引用(テキストに限る)</li>
      <li>転載・引用の許可が明記されているコンテンツ</li>
      <li>その他管理人が個別に許可した範囲</li>
    </ol>
    <p>すべての場合において引用元の明記およびWebコンテンツの場合に限り引用元へリンクを張ることとします。</p>
    <p>許諾なき転載・引用に関しては<strong><em>法的手段も含め</em></strong>厳正に対処いたします。</p>
    <h2 id="本条文の発効">本条文の発効</h2>
    <p>本条文は当サイトの利用の継続をもって同意したと見なし発効します。</p>
  </div>);